app/controllers/provider_controller.rb

SELECT "providers".* FROM "providers"
---
  def index
    @provider = Provider.all.to_a